---
type: AnalyticalBusData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 3
tags: [revit-api, class]
---

# AnalyticalBusData

`Autodesk.Revit.DB.Electrical.AnalyticalBusData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CurrentRating | 2023 | `public double CurrentRating { get ; set ; }` |
| Property | TotalConnectedCurrent | 2023 | `public double TotalConnectedCurrent { get ; }` |
| Property | Voltage | 2023 | `public double Voltage { get ; set ; }` |